/********************************************************************
// FileName: d:\work\FKAISystem\Include\IAIDefine.h
// Date:     2007/11/24
// Author:   FreeKnightDuzhi
// Comment:  
*********************************************************************/

#pragma once

//--------------------------------------------------------------------

#include "IAIAny.h"

//--------------------------------------------------------------------

AISYSTEM_SPACE_BEGIN

/****************************************************************
+	CLASS
-----------------------------------------------------------------
+   类名:	CBehaviorParams
+   功能：	用来保存AI行为参数，创建AI时用
+   描述:	
-----------------------------------------------------------------
*****************************************************************/
class CBehaviorParams
{
	////////////////////////////////////////////
	//	构造/析构
public:
	CBehaviorParams(void){};
	~CBehaviorParams(void){};

	////////////////////////////////////////////
	//	数据成员。公开，可以直接访问
public:
	unsigned int		m_uiAIID;	// 要创建的AI的ID
	std::vector<CAIAny>	m_Params;	// AI参数
};

/****************************************************************
+	CLASS
-----------------------------------------------------------------
+   类名:	CAICustomTriggerParams
+   功能：	结构体，保存用户自定义触发器的创建参数
+   描述:	
-----------------------------------------------------------------
*****************************************************************/
class CAICustomTriggerParams
{
	////////////////////////////////////////////
	//	数据成员
public:
	unsigned int					m_uiTriggerTypeID;	// 用户自定义触发器的类型ID
	std::vector<float>				m_Params;			// 用户自定义触发器的参数表
};


/****************************************************************
+	ENUM
-----------------------------------------------------------------
+   名称:	
+   功能:	
+   描述:	枚举行为的执行状态
-----------------------------------------------------------------
*****************************************************************/
enum EAIBehaviorState
{
	EAIBS_Executing = 0,	// 行为正在执行
	EAIBS_Interrupt,		// 行为被打断
	EAIBS_Failed,			// 行为执行失败
	EAIBS_Succeed,			// 行为执行成功
	EAIBS_End
};


AISYSTEM_SPACE_END